--- crates/x3-common/src/signing.rs
+++ delete match arm (Signature::Ed25519(sig), PublicKey::Ed25519(pk)) in Signature::verify_hash
@@ -120,19 +120,17 @@
             }
             _ => false, // Mismatched key types
         }
     }
 
     /// Verify this signature against a pre-hashed message
     pub fn verify_hash(&self, message_hash: &[u8; 32], public_key: &PublicKey) -> bool {
         match (self, public_key) {
-            (Signature::Ed25519(sig), PublicKey::Ed25519(pk)) => {
-                ed25519::Signature::verify(sig, &message_hash[..], pk)
-            }
+             /* ~ changed by cargo-mutants ~ */
             (Signature::Secp256k1(sig), PublicKey::Secp256k1(pk)) => {
                 match sp_io::crypto::secp256k1_ecdsa_recover(sig, message_hash) {
                     Ok(recovered) => recovered.as_ref() == &pk[1..],
                     Err(_) => false,
                 }
             }
             (Signature::Sr25519(sig), PublicKey::Sr25519(pk)) => {
                 sr25519::Signature::verify(sig, &message_hash[..], pk)
