--- crates/x3-common/src/signing.rs
+++ replace == with != in Signature::verify_hash
@@ -125,17 +125,17 @@
     /// Verify this signature against a pre-hashed message
     pub fn verify_hash(&self, message_hash: &[u8; 32], public_key: &PublicKey) -> bool {
         match (self, public_key) {
             (Signature::Ed25519(sig), PublicKey::Ed25519(pk)) => {
                 ed25519::Signature::verify(sig, &message_hash[..], pk)
             }
             (Signature::Secp256k1(sig), PublicKey::Secp256k1(pk)) => {
                 match sp_io::crypto::secp256k1_ecdsa_recover(sig, message_hash) {
-                    Ok(recovered) => recovered.as_ref() == &pk[1..],
+                    Ok(recovered) => recovered.as_ref() != /* ~ changed by cargo-mutants ~ */ &pk[1..],
                     Err(_) => false,
                 }
             }
             (Signature::Sr25519(sig), PublicKey::Sr25519(pk)) => {
                 sr25519::Signature::verify(sig, &message_hash[..], pk)
             }
             _ => false,
         }
