--- crates/x3-common/src/signing.rs
+++ replace Ed25519Signer::generate -> Self with Default::default()
@@ -174,19 +174,17 @@
 pub struct Ed25519Signer {
     pair: ed25519::Pair,
     public_key: ed25519::Public,
 }
 
 impl Ed25519Signer {
     /// Generate a new ed25519 keypair
     pub fn generate() -> Self {
-        let (pair, _, _) = ed25519::Pair::generate_with_phrase(None);
-        let public_key = pair.public();
-        Self { pair, public_key }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a signer from a seed phrase
     pub fn from_phrase(phrase: &str, password: Option<&str>) -> Result<Self, &'static str> {
         let (pair, _) =
             ed25519::Pair::from_phrase(phrase, password).map_err(|_| "Invalid seed phrase")?;
         let public_key = pair.public();
         Ok(Self { pair, public_key })
