--- crates/x3-common/src/signing.rs
+++ replace Ed25519Signer::from_seed -> Self with Default::default()
@@ -189,19 +189,17 @@
         let (pair, _) =
             ed25519::Pair::from_phrase(phrase, password).map_err(|_| "Invalid seed phrase")?;
         let public_key = pair.public();
         Ok(Self { pair, public_key })
     }
 
     /// Create a signer from a raw seed (32 bytes)
     pub fn from_seed(seed: &[u8; 32]) -> Self {
-        let pair = ed25519::Pair::from_seed(seed);
-        let public_key = pair.public();
-        Self { pair, public_key }
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a signer from a secret key (32 bytes)
     pub fn from_secret_key(secret: &[u8; 32]) -> Self {
         let pair = ed25519::Pair::from_seed(secret);
         let public_key = pair.public();
         Self { pair, public_key }
     }
