--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Ed25519Signer>::key_type -> KeyType with Default::default()
@@ -204,17 +204,17 @@
         let pair = ed25519::Pair::from_seed(secret);
         let public_key = pair.public();
         Self { pair, public_key }
     }
 }
 
 impl Signer for Ed25519Signer {
     fn key_type(&self) -> KeyType {
-        KeyType::Ed25519
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn sign(&self, message: &[u8]) -> Signature {
         let signature = self.pair.sign(message);
         Signature::Ed25519(signature)
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
