--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Ed25519Signer>::public_key -> PublicKey with Default::default()
@@ -218,17 +218,17 @@
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
         let signature = self.pair.sign(message_hash);
         Signature::Ed25519(signature)
     }
 
     fn public_key(&self) -> PublicKey {
-        PublicKey::Ed25519(self.public_key)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// secp256k1 signer for EVM
 #[derive(Clone)]
 pub struct Secp256k1Signer {
     secret_key: [u8; 32],
     public_key: [u8; 65],
