--- crates/x3-common/src/signing.rs
+++ replace Secp256k1Signer::from_secret_key -> Result<Self, &'static str> with Ok(Default::default())
@@ -250,32 +250,17 @@
         Self {
             secret_key,
             public_key: pk,
         }
     }
 
     /// Create a signer from a secret key (32 bytes)
     pub fn from_secret_key(secret: &[u8; 32]) -> Result<Self, &'static str> {
-        use secp256k1::{Secp256k1, SecretKey};
-
-        let secp = Secp256k1::new();
-        let secret_key = SecretKey::from_slice(secret).map_err(|_| "Invalid secret key")?;
-        let public_key = secret_key.public_key(&secp).serialize_uncompressed();
-
-        let mut pk = [0u8; 65];
-        pk.copy_from_slice(&public_key);
-
-        let mut sk = [0u8; 32];
-        sk.copy_from_slice(secret);
-
-        Ok(Self {
-            secret_key: sk,
-            public_key: pk,
-        })
+        Ok(Default::default()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Create a signer from a hex-encoded secret key
     pub fn from_hex_secret(hex: &str) -> Result<Self, &'static str> {
         let secret = hex::decode(hex).map_err(|_| "Invalid hex")?;
         if secret.len() != 32 {
             return Err("Secret key must be 32 bytes");
         }
