--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Secp256k1Signer>::sign -> Signature with Default::default()
@@ -286,22 +286,17 @@
 }
 
 impl Signer for Secp256k1Signer {
     fn key_type(&self) -> KeyType {
         KeyType::Secp256k1
     }
 
     fn sign(&self, message: &[u8]) -> Signature {
-        use secp256k1::Message;
-
-        let message_hash = blake2_256(message);
-        let message = Message::from_digest_slice(&message_hash).unwrap();
-        let signature = sign_secp256k1_message(&self.secret_key, &message);
-        Signature::Secp256k1(signature)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
         use secp256k1::Message;
 
         let message = Message::from_digest_slice(message_hash).unwrap();
         let signature = sign_secp256k1_message(&self.secret_key, &message);
         Signature::Secp256k1(signature)
