--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Secp256k1Signer>::sign_hash -> Signature with Default::default()
@@ -295,21 +295,17 @@
 
         let message_hash = blake2_256(message);
         let message = Message::from_digest_slice(&message_hash).unwrap();
         let signature = sign_secp256k1_message(&self.secret_key, &message);
         Signature::Secp256k1(signature)
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
-        use secp256k1::Message;
-
-        let message = Message::from_digest_slice(message_hash).unwrap();
-        let signature = sign_secp256k1_message(&self.secret_key, &message);
-        Signature::Secp256k1(signature)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn public_key(&self) -> PublicKey {
         PublicKey::Secp256k1(self.public_key)
     }
 }
 
 fn sign_secp256k1_message(secret_key: &[u8; 32], message: &secp256k1::Message) -> [u8; 65] {
