--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Sr25519Signer>::sign -> Signature with Default::default()
@@ -362,18 +362,17 @@
 }
 
 impl Signer for Sr25519Signer {
     fn key_type(&self) -> KeyType {
         KeyType::Sr25519
     }
 
     fn sign(&self, message: &[u8]) -> Signature {
-        let signature = self.pair.sign(message);
-        Signature::Sr25519(signature)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
         let signature = self.pair.sign(message_hash);
         Signature::Sr25519(signature)
     }
 
     fn public_key(&self) -> PublicKey {
