--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Sr25519Signer>::sign_hash -> Signature with Default::default()
@@ -367,18 +367,17 @@
     }
 
     fn sign(&self, message: &[u8]) -> Signature {
         let signature = self.pair.sign(message);
         Signature::Sr25519(signature)
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
-        let signature = self.pair.sign(message_hash);
-        Signature::Sr25519(signature)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 
     fn public_key(&self) -> PublicKey {
         PublicKey::Sr25519(self.public_key)
     }
 }
 
 /// Verify a signature for a given key type
