--- crates/x3-common/src/signing.rs
+++ replace <impl Signer for Sr25519Signer>::public_key -> PublicKey with Default::default()
@@ -372,17 +372,17 @@
     }
 
     fn sign_hash(&self, message_hash: &[u8; 32]) -> Signature {
         let signature = self.pair.sign(message_hash);
         Signature::Sr25519(signature)
     }
 
     fn public_key(&self) -> PublicKey {
-        PublicKey::Sr25519(self.public_key)
+        Default::default() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 /// Verify a signature for a given key type
 pub fn verify_signature(
     signature: &[u8],
     message: &[u8],
     public_key: &[u8],
