--- crates/x3-common/src/signing.rs
+++ replace verify_signature -> bool with false
@@ -383,65 +383,17 @@
 
 /// Verify a signature for a given key type
 pub fn verify_signature(
     signature: &[u8],
     message: &[u8],
     public_key: &[u8],
     key_type: KeyType,
 ) -> bool {
-    match key_type {
-        KeyType::Ed25519 => {
-            if signature.len() != 64 || public_key.len() != 32 {
-                return false;
-            }
-            let sig = ed25519::Signature::from_raw({
-                let mut buf = [0u8; 64];
-                buf.copy_from_slice(signature);
-                buf
-            });
-            let pk = ed25519::Public::from_raw({
-                let mut buf = [0u8; 32];
-                buf.copy_from_slice(public_key);
-                buf
-            });
-            ed25519::Signature::verify(&sig, message, &pk)
-        }
-        KeyType::Secp256k1 => {
-            // secp256k1_ecdsa_recover returns 64-byte uncompressed key (no 0x04 prefix).
-            // public_key is expected to be 65 bytes (uncompressed with 0x04 prefix).
-            if signature.len() != 65 || public_key.len() != 65 {
-                return false;
-            }
-            let mut sig = [0u8; 65];
-            sig.copy_from_slice(signature);
-            let mut pk = [0u8; 64];
-            pk.copy_from_slice(&public_key[1..]); // skip 0x04 prefix
-            match sp_io::crypto::secp256k1_ecdsa_recover(&sig, &blake2_256(message)) {
-                Ok(recovered) => recovered.as_ref() == pk.as_ref(),
-                Err(_) => false,
-            }
-        }
-        KeyType::Sr25519 => {
-            if signature.len() != 64 || public_key.len() != 32 {
-                return false;
-            }
-            let sig = sr25519::Signature::from_raw({
-                let mut buf = [0u8; 64];
-                buf.copy_from_slice(signature);
-                buf
-            });
-            let pk = sr25519::Public::from_raw({
-                let mut buf = [0u8; 32];
-                buf.copy_from_slice(public_key);
-                buf
-            });
-            sr25519::Signature::verify(&sig, message, &pk)
-        }
-    }
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 /// Verify a pre-hashed signature for a given key type
 pub fn verify_signature_hash(
     signature: &[u8],
     message_hash: &[u8; 32],
     public_key: &[u8],
     key_type: KeyType,
