--- crates/x3-common/src/signing.rs
+++ replace || with && in verify_signature
@@ -385,17 +385,17 @@
 pub fn verify_signature(
     signature: &[u8],
     message: &[u8],
     public_key: &[u8],
     key_type: KeyType,
 ) -> bool {
     match key_type {
         KeyType::Ed25519 => {
-            if signature.len() != 64 || public_key.len() != 32 {
+            if signature.len() != 64 && /* ~ changed by cargo-mutants ~ */ public_key.len() != 32 {
                 return false;
             }
             let sig = ed25519::Signature::from_raw({
                 let mut buf = [0u8; 64];
                 buf.copy_from_slice(signature);
                 buf
             });
             let pk = ed25519::Public::from_raw({
