--- crates/x3-common/src/signing.rs
+++ replace != with == in verify_signature
@@ -403,17 +403,17 @@
                 buf.copy_from_slice(public_key);
                 buf
             });
             ed25519::Signature::verify(&sig, message, &pk)
         }
         KeyType::Secp256k1 => {
             // secp256k1_ecdsa_recover returns 64-byte uncompressed key (no 0x04 prefix).
             // public_key is expected to be 65 bytes (uncompressed with 0x04 prefix).
-            if signature.len() != 65 || public_key.len() != 65 {
+            if signature.len() != 65 || public_key.len() == /* ~ changed by cargo-mutants ~ */ 65 {
                 return false;
             }
             let mut sig = [0u8; 65];
             sig.copy_from_slice(signature);
             let mut pk = [0u8; 64];
             pk.copy_from_slice(&public_key[1..]); // skip 0x04 prefix
             match sp_io::crypto::secp256k1_ecdsa_recover(&sig, &blake2_256(message)) {
                 Ok(recovered) => recovered.as_ref() == pk.as_ref(),
