--- crates/x3-common/src/signing.rs
+++ replace != with == in verify_signature_hash
@@ -443,17 +443,17 @@
 pub fn verify_signature_hash(
     signature: &[u8],
     message_hash: &[u8; 32],
     public_key: &[u8],
     key_type: KeyType,
 ) -> bool {
     match key_type {
         KeyType::Ed25519 => {
-            if signature.len() != 64 || public_key.len() != 32 {
+            if signature.len() == /* ~ changed by cargo-mutants ~ */ 64 || public_key.len() != 32 {
                 return false;
             }
             let sig = ed25519::Signature::from_raw({
                 let mut buf = [0u8; 64];
                 buf.copy_from_slice(signature);
                 buf
             });
             let pk = ed25519::Public::from_raw({
