--- crates/x3-common/src/signing.rs
+++ replace Signature::as_bytes -> &[u8] with Vec::leak(Vec::new())
@@ -90,21 +90,17 @@
     Secp256k1([u8; 65]),
     /// sr25519 signature (64 bytes)
     Sr25519(sr25519::Signature),
 }
 
 impl Signature {
     /// Get the raw bytes of the signature
     pub fn as_bytes(&self) -> &[u8] {
-        match self {
-            Signature::Ed25519(sig) => sig.as_ref(),
-            Signature::Secp256k1(sig) => sig.as_ref(),
-            Signature::Sr25519(sig) => sig.as_ref(),
-        }
+        Vec::leak(Vec::new()) /* ~ changed by cargo-mutants ~ */
     }
 
     /// Verify this signature against a message and public key
     pub fn verify(&self, message: &[u8], public_key: &PublicKey) -> bool {
         match (self, public_key) {
             (Signature::Ed25519(sig), PublicKey::Ed25519(pk)) => {
                 ed25519::Signature::verify(sig, message, pk)
             }
