--- crates/x3-common/src/weight_metering.rs
+++ replace OperationCosts::signing -> u64 with 1
@@ -180,21 +180,17 @@
             transaction_base: 1000,
         }
     }
 }
 
 impl OperationCosts {
     /// Get the cost of signing for a given key type
     pub fn signing(&self, key_type: KeyType) -> u64 {
-        match key_type {
-            KeyType::Ed25519 => self.signing_ed25519,
-            KeyType::Secp256k1 => self.signing_secp256k1,
-            KeyType::Sr25519 => self.signing_sr25519,
-        }
+        1 /* ~ changed by cargo-mutants ~ */
     }
 
     /// Get the cost of verification for a given key type
     pub fn verify(&self, key_type: KeyType) -> u64 {
         match key_type {
             KeyType::Ed25519 => self.verify_ed25519,
             KeyType::Secp256k1 => self.verify_secp256k1,
             KeyType::Sr25519 => self.verify_sr25519,
